{
    "format": "layers-model",
    "generatedBy": "keras v3.8.0",
    "convertedBy": "TensorFlow.js Converter v4.22.0",
    "modelTopology": {
        "keras_version": "3.8.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Functional",
            "config": {
                "name": "functional",
                "trainable": true,
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "inputShape": [
                                14,
                                8,
                                8
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "name": "input_layer"
                        },
                        "name": "input_layer",
                        "inbound_nodes": []
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "filters": 64,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d",
                        "inbound_nodes": [[["input_layer", 0, 0]]]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "axis": -1,
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "gamma_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_mean_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_variance_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null,
                            "synchronized": false
                        },
                        "name": "batch_normalization",
                        "inbound_nodes": [[["conv2d", 0, 0]]]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_1",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "filters": 64,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_1",
                        "inbound_nodes": [[["batch_normalization", 0, 0]]]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_1",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "axis": -1,
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "gamma_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_mean_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_variance_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null,
                            "synchronized": false
                        },
                        "name": "batch_normalization_1",
                        "inbound_nodes": [[["conv2d_1", 0, 0]]]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_2",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "filters": 128,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_2",
                        "inbound_nodes": [[["batch_normalization_1", 0, 0]]]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_2",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "axis": -1,
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "gamma_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_mean_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_variance_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null,
                            "synchronized": false
                        },
                        "name": "batch_normalization_2",
                        "inbound_nodes": [[["conv2d_2", 0, 0]]]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_3",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "filters": 128,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_3",
                        "inbound_nodes": [[["batch_normalization_2", 0, 0]]]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_3",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "axis": -1,
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "gamma_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_mean_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_variance_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null,
                            "synchronized": false
                        },
                        "name": "batch_normalization_3",
                        "inbound_nodes": [[["conv2d_3", 0, 0]]]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_4",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "filters": 128,
                            "kernel_size": [
                                1,
                                1
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_4",
                        "inbound_nodes": [[["batch_normalization_1", 0, 0]]]
                    },
                    {
                        "class_name": "Add",
                        "config": {
                            "name": "add",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            }
                        },
                        "name": "add",
                        "inbound_nodes": [[["batch_normalization_3", 0, 0], ["conv2d_4", 0, 0]]]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "activation",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "activation": "relu"
                        },
                        "name": "activation",
                        "inbound_nodes": [[["add", 0, 0]]]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_5",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "filters": 256,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_5",
                        "inbound_nodes": [[["activation", 0, 0]]]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_4",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "axis": -1,
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "gamma_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_mean_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_variance_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null,
                            "synchronized": false
                        },
                        "name": "batch_normalization_4",
                        "inbound_nodes": [[["conv2d_5", 0, 0]]]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_6",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "filters": 256,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_6",
                        "inbound_nodes": [[["batch_normalization_4", 0, 0]]]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_5",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "axis": -1,
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "gamma_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_mean_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_variance_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null,
                            "synchronized": false
                        },
                        "name": "batch_normalization_5",
                        "inbound_nodes": [[["conv2d_6", 0, 0]]]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_7",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "filters": 256,
                            "kernel_size": [
                                1,
                                1
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_7",
                        "inbound_nodes": [[["activation", 0, 0]]]
                    },
                    {
                        "class_name": "Add",
                        "config": {
                            "name": "add_1",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            }
                        },
                        "name": "add_1",
                        "inbound_nodes": [[["batch_normalization_5", 0, 0], ["conv2d_7", 0, 0]]]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "activation_1",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "activation": "relu"
                        },
                        "name": "activation_1",
                        "inbound_nodes": [[["add_1", 0, 0]]]
                    },
                    {
                        "class_name": "GlobalAveragePooling2D",
                        "config": {
                            "name": "global_average_pooling2d",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "data_format": "channels_last",
                            "keepdims": false
                        },
                        "name": "global_average_pooling2d",
                        "inbound_nodes": [[["activation_1", 0, 0]]]
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "units": 512,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "dense",
                        "inbound_nodes": [[["global_average_pooling2d", 0, 0]]]
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "rate": 0.3,
                            "seed": null,
                            "noise_shape": null
                        },
                        "name": "dropout",
                        "inbound_nodes": [[["dense", 0, 0]]]
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_1",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "units": 256,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "dense_1",
                        "inbound_nodes": [[["dropout", 0, 0]]]
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_1",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "rate": 0.2,
                            "seed": null,
                            "noise_shape": null
                        },
                        "name": "dropout_1",
                        "inbound_nodes": [[["dense_1", 0, 0]]]
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_2",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "units": 128,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "dense_2",
                        "inbound_nodes": [[["dropout_1", 0, 0]]]
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "position_score",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "units": 1,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "position_score",
                        "inbound_nodes": [[["dense_2", 0, 0]]]
                    }
                ],
                "input_layers": [
                    [
                        "input_layer",
                        0,
                        0
                    ]
                ],
                "output_layers": [
                    [
                        "position_score",
                        0,
                        0
                    ]
                ]
            }
        },
        "training_config": {
            "loss": "mse",
            "loss_weights": null,
            "metrics": [
                "mae"
            ],
            "weighted_metrics": null,
            "run_eagerly": false,
            "steps_per_execution": 1,
            "jit_compile": true,
            "optimizer_config": {
                "class_name": "Adam",
                "config": {
                    "name": "adam",
                    "learning_rate": 6.25000029685907e-05,
                    "weight_decay": null,
                    "clipnorm": null,
                    "global_clipnorm": null,
                    "clipvalue": null,
                    "use_ema": false,
                    "ema_momentum": 0.99,
                    "ema_overwrite_frequency": null,
                    "loss_scale_factor": null,
                    "gradient_accumulation_steps": null,
                    "beta_1": 0.9,
                    "beta_2": 0.999,
                    "epsilon": 1e-07,
                    "amsgrad": false
                }
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of2.bin",
                "group1-shard2of2.bin"
            ],
            "weights": [
                {
                    "name": "batch_normalization/gamma",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
