{
    "format": "layers-model",
    "generatedBy": "keras v3.8.0",
    "convertedBy": "TensorFlow.js Converter v4.22.0",
    "modelTopology": {
        "keras_version": "3.8.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Functional",
            "config": {
                "name": "functional_1",
                "trainable": true,
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "inputShape": [
                                8,
                                8,
                                12
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "name": "input_layer_1"
                        },
                        "name": "input_layer_1",
                        "inbound_nodes": []
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_15",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "filters": 64,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_15",
                        "inbound_nodes": [[["input_layer_1", 0, 0]]]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_15",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "axis": -1,
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "gamma_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_mean_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_variance_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null,
                            "synchronized": false
                        },
                        "name": "batch_normalization_15",
                        "inbound_nodes": [[["conv2d_15", 0, 0]]]
                    },
                    {
                        "class_name": "ReLU",
                        "config": {
                            "name": "re_lu_13",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "max_value": null,
                            "negative_slope": 0.0,
                            "threshold": 0.0
                        },
                        "name": "re_lu_13",
                        "inbound_nodes": [[["batch_normalization_15", 0, 0]]]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_16",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "filters": 64,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_16",
                        "inbound_nodes": [[["re_lu_13", 0, 0]]]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_16",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "axis": -1,
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "gamma_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_mean_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_variance_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null,
                            "synchronized": false
                        },
                        "name": "batch_normalization_16",
                        "inbound_nodes": [[["conv2d_16", 0, 0]]]
                    },
                    {
                        "class_name": "ReLU",
                        "config": {
                            "name": "re_lu_14",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "max_value": null,
                            "negative_slope": 0.0,
                            "threshold": 0.0
                        },
                        "name": "re_lu_14",
                        "inbound_nodes": [[["batch_normalization_16", 0, 0]]]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_17",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "filters": 64,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_17",
                        "inbound_nodes": [[["re_lu_14", 0, 0]]]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_17",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "axis": -1,
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "gamma_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_mean_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_variance_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null,
                            "synchronized": false
                        },
                        "name": "batch_normalization_17",
                        "inbound_nodes": [[["conv2d_17", 0, 0]]]
                    },
                    {
                        "class_name": "Add",
                        "config": {
                            "name": "add_6",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            }
                        },
                        "name": "add_6",
                        "inbound_nodes": [[["batch_normalization_17", 0, 0], ["re_lu_13", 0, 0]]]
                    },
                    {
                        "class_name": "ReLU",
                        "config": {
                            "name": "re_lu_15",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "max_value": null,
                            "negative_slope": 0.0,
                            "threshold": 0.0
                        },
                        "name": "re_lu_15",
                        "inbound_nodes": [[["add_6", 0, 0]]]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_18",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "filters": 64,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_18",
                        "inbound_nodes": [[["re_lu_15", 0, 0]]]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_18",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "axis": -1,
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "gamma_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_mean_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_variance_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null,
                            "synchronized": false
                        },
                        "name": "batch_normalization_18",
                        "inbound_nodes": [[["conv2d_18", 0, 0]]]
                    },
                    {
                        "class_name": "ReLU",
                        "config": {
                            "name": "re_lu_16",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "max_value": null,
                            "negative_slope": 0.0,
                            "threshold": 0.0
                        },
                        "name": "re_lu_16",
                        "inbound_nodes": [[["batch_normalization_18", 0, 0]]]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_19",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "filters": 64,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_19",
                        "inbound_nodes": [[["re_lu_16", 0, 0]]]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_19",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "axis": -1,
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "gamma_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_mean_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_variance_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null,
                            "synchronized": false
                        },
                        "name": "batch_normalization_19",
                        "inbound_nodes": [[["conv2d_19", 0, 0]]]
                    },
                    {
                        "class_name": "Add",
                        "config": {
                            "name": "add_7",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            }
                        },
                        "name": "add_7",
                        "inbound_nodes": [[["batch_normalization_19", 0, 0], ["re_lu_15", 0, 0]]]
                    },
                    {
                        "class_name": "ReLU",
                        "config": {
                            "name": "re_lu_17",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "max_value": null,
                            "negative_slope": 0.0,
                            "threshold": 0.0
                        },
                        "name": "re_lu_17",
                        "inbound_nodes": [[["add_7", 0, 0]]]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_20",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "filters": 128,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_20",
                        "inbound_nodes": [[["re_lu_17", 0, 0]]]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_20",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "axis": -1,
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "gamma_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_mean_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_variance_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null,
                            "synchronized": false
                        },
                        "name": "batch_normalization_20",
                        "inbound_nodes": [[["conv2d_20", 0, 0]]]
                    },
                    {
                        "class_name": "ReLU",
                        "config": {
                            "name": "re_lu_18",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "max_value": null,
                            "negative_slope": 0.0,
                            "threshold": 0.0
                        },
                        "name": "re_lu_18",
                        "inbound_nodes": [[["batch_normalization_20", 0, 0]]]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_21",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "filters": 128,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_21",
                        "inbound_nodes": [[["re_lu_18", 0, 0]]]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_22",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "filters": 128,
                            "kernel_size": [
                                1,
                                1
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_22",
                        "inbound_nodes": [[["re_lu_17", 0, 0]]]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_21",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "axis": -1,
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "gamma_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_mean_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_variance_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null,
                            "synchronized": false
                        },
                        "name": "batch_normalization_21",
                        "inbound_nodes": [[["conv2d_21", 0, 0]]]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_22",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "axis": -1,
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "gamma_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_mean_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_variance_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null,
                            "synchronized": false
                        },
                        "name": "batch_normalization_22",
                        "inbound_nodes": [[["conv2d_22", 0, 0]]]
                    },
                    {
                        "class_name": "Add",
                        "config": {
                            "name": "add_8",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            }
                        },
                        "name": "add_8",
                        "inbound_nodes": [[["batch_normalization_21", 0, 0], ["batch_normalization_22", 0, 0]]]
                    },
                    {
                        "class_name": "ReLU",
                        "config": {
                            "name": "re_lu_19",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "max_value": null,
                            "negative_slope": 0.0,
                            "threshold": 0.0
                        },
                        "name": "re_lu_19",
                        "inbound_nodes": [[["add_8", 0, 0]]]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_23",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "filters": 128,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": true,
